<a href="https://colab.research.google.com/github/anicelysantos/book-python-para-analise-de-dados/blob/main/tratamento_dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

***Capítulo 8 - Python para análise de dados***

In [ ]:
#!pip install pandas==1.3.2

In [2]:
import pandas as pd
import numpy as np

# Indexação hierárquica

In [3]:
data = pd.Series(np.random.randn(9), index=[['a','a','a','b','b','c','c','d','d'],[1,2,3,1,3,1,2,2,3]])
data

a  1    0.687030
   2    1.011805
   3    0.675342
b  1    0.574898
   3   -2.008544
c  1    0.678568
   2    2.120069
d  2   -0.760731
   3   -1.223950
dtype: float64

In [4]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [5]:
data['b']

1    0.574898
3   -2.008544
dtype: float64

In [6]:
data['b':'c']

b  1    0.574898
   3   -2.008544
c  1    0.678568
   2    2.120069
dtype: float64

In [7]:
data.loc[['b','d']]

b  1    0.574898
   3   -2.008544
d  2   -0.760731
   3   -1.223950
dtype: float64

In [8]:
data.loc[:,2]

a    1.011805
c    2.120069
d   -0.760731
dtype: float64

In [9]:
data.unstack()

          1         2         3
a  0.687030  1.011805  0.675342
b  0.574898       NaN -2.008544
c  0.678568  2.120069       NaN
d       NaN -0.760731 -1.223950

In [10]:
data.unstack().stack()

a  1    0.687030
   2    1.011805
   3    0.675342
b  1    0.574898
   3   -2.008544
c  1    0.678568
   2    2.120069
d  2   -0.760731
   3   -1.223950
dtype: float64

In [11]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)), index=[['a','a','b','b'], [1,2,1,2]],columns=[['Ohio','Ohio','Colorado'],['Green','Red','Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [12]:
frame.index.names = ['key1', 'key2']

In [13]:
frame.columns.names = ['state','color']

In [14]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [15]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

outra forma de criar as mesmas colunas:<br>
*MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green','Red','Green']], names=['state','color'])*

**Reorganizando e ordenando níveis**

In [16]:
#swaplevel troca a ordem do conteudo passado por argumento
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [17]:
#Ordena os index
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [18]:
frame.swaplevel (0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

**Estatística de resumo por nível**

In [19]:
frame.sum(level='key2')

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  """Entry point for launching an IPython kernel.

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [20]:
frame.sum(level='color', axis=1)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  """Entry point for launching an IPython kernel.

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

**Indexando com as colunas de um DataFrame**

In [21]:
frame = pd.DataFrame({'a':range(7), 'b':range(7,0,-1), 'c':['one','one','one','two','two','two','two'], 'd':[0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [22]:
frame2 = frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [23]:
frame.set_index(['c','d'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [24]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

# Combinando e mesclando conjuntos de dados

**Junções no DataFrame no estilo de banco de dados**

In [25]:
df1 = pd.DataFrame({'key':['b','b','a','c','a','a','b'], 'data1':range(7)})

In [26]:
df2 = pd.DataFrame({'key':['a','b','d'], 'data2': range(3)})

In [27]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [28]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [29]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [30]:
pd.merge(df1,df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [31]:
df3 = pd.DataFrame({'lkey':['b','b','a','c','a','a','b'], 'data1':range(7)})

In [32]:
df4 = pd.DataFrame({'rkey':['a','b','d'], 'data2':range(3)})

In [33]:
pd.merge(df3,df4, left_on='lkey',right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [34]:
pd.merge(df1,df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [35]:
df1 = pd.DataFrame({'key':['b','b','a','c','a','b'], 'data1':range(6)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [36]:
df2 = pd.DataFrame({'key':['a','b','a','b','d'], 'data2': range(5)})
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [37]:
pd.merge(df1,df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [38]:
left = pd.DataFrame({'key1':['foo','foo','bar'], 'key2':['one','two','one'],'lval':[1,2,3]})

In [39]:
right = pd.DataFrame({'key1':['foo','foo','bar','bar'],'key2':['one','one','one','two'],'rval':[4,5,6,7]})

In [40]:
#indicator aponta de onde vieram os dados
pd.merge(left, right, on=['key1','key2'], how='outer', indicator=True)

  key1 key2  lval  rval      _merge
0  foo  one   1.0   4.0        both
1  foo  one   1.0   5.0        both
2  foo  two   2.0   NaN   left_only
3  bar  one   3.0   6.0        both
4  bar  two   NaN   7.0  right_only

In [41]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [42]:
pd.merge(left, right, on='key1', suffixes=('_left','_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

**Fazendo merge com base no índice**

In [43]:
left1 = pd.DataFrame({'key':['a','b','a','a','b','c'], 'value': range(6)})
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [44]:
right1 = pd.DataFrame({'group_val':[3.5, 7]}, index=['a','b'])
right1

   group_val
a        3.5
b        7.0

In [45]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [46]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [47]:
lefth = pd.DataFrame({'key1':['Ohio','Ohio','Ohio','Nevada','Nevada'], 'key2':[2000,2001,2002,2001,2002],'data':np.arange(5.)})
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [48]:
righth = pd.DataFrame(np.arange(12).reshape((6,2)), index=[['Nevada', 'Nevada','Ohio','Ohio','Ohio','Ohio'],[2001,2000,2000,2000,2001,2002]], columns=['event1','event2'])
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [49]:
pd.merge(lefth,righth, left_on=['key1','key2'], right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [50]:
pd.merge(lefth,righth, left_on=['key1','key2'], right_index=True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [51]:
left2 = pd.DataFrame([[1.,2.], [3.,4.], [5.,6.]], index=['a','c','e'], columns=['ohio','Nevada'])
left2

   ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [52]:
right2 = pd.DataFrame([[7., 8.], [9.,10.], [11.,12.], [13,14]], index=['b','c','d','e'], columns=['Missouri','Alabama'])
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [53]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [54]:
#outra maneira de fazer o exemplo anterior
left2.join(right2, how='outer')

   ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [55]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [56]:
another = pd.DataFrame([[7.,8.], [9.,10.], [11., 12.], [16.,17.]], index=['a','c','e','f'], columns=['New York', 'Oregon'])
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [57]:
left2.join([right2, another])

   ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [58]:
left2.join([right2, another], how='outer')

   ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0
b   NaN     NaN       7.0      8.0       NaN     NaN
d   NaN     NaN      11.0     12.0       NaN     NaN
f   NaN     NaN       NaN      NaN      16.0    17.0

**Concatenando ao longo de um eixo**

In [59]:
arr = np.arange(12).reshape((3,4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [60]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [61]:
s1 = pd.Series([0,1], index=['a','b'])

In [62]:
s2 = pd.Series([2,3,4], index=['c','d','e'])

In [63]:
s3 = pd.Series([5,6], index=['f','g'])

In [64]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [65]:
pd.concat([s1,s2,s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [66]:
s4 = pd.concat([s1, s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

In [67]:
pd.concat([s1,s4], axis=1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [68]:
pd.concat([s1,s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

In [72]:
#especificar os eixos da concatenação
pd.concat([s1,s4], axis=1).reindex(columns=['a','c','b','e'])

    a   c   b   e
a NaN NaN NaN NaN
b NaN NaN NaN NaN
f NaN NaN NaN NaN
g NaN NaN NaN NaN

In [71]:
result = pd.concat([s1,s1,s3], keys=['one','two','three'])
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [ ]:
result.unstack()

In [ ]:
pd.concat([s1,s2,s3], axis=1, keys=['one','two','three'])

In [ ]:
df1 = pd.DataFrame(np.arange(6).reshape(3,2), index=['a','b','c'], columns=['onde','two'])
df1

In [ ]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2,2), index=['a','c'], columns=['three','four'])
df2

In [ ]:
pd.concat([df1, df2], axis=1, keys=['level1','level2'])

In [ ]:
pd.concat({'level1':df1,'level2':df2}, axis=1)

In [ ]:
pd.concat([df1, df2], axis=1, keys=['level1','level2'], names=['upper','lower'])

In [ ]:
df1 = pd.DataFrame(np.random.randn(3,4), columns=['a','b','c','d'])
df1

In [ ]:
df2 = pd.DataFrame(np.random.randn(2,3), columns=['b','d','a'])
df2

In [ ]:
#ignore_index ignora o index que vem do outro dataframe e cria uma sequencia
pd.concat([df1,df2], ignore_index=True)

**Combinando dados com sobreposição**

In [ ]:
a = pd.Series([np.nan, 2.5, 0.0, 3.5, 4.5, np.nan], index=['f','e','d','c','b','a'])
a

In [ ]:
b = pd.Series([0., np.nan, 2., np.nan, np.nan, 5.], index=['a','b','c','d','e','f'])
b

In [ ]:
np.where(pd.isnull(a), b, a)

In [ ]:
#mesma coisa do exemplo anterior
b.combine_first(a)

In [ ]:
df1 = pd.DataFrame({'a':[1., np.nan, 5.,np.nan], 'b':[np.nan, 2., np.nan, 6.], 'c': range(2,18,4)})
df1

In [ ]:
df2 = pd.DataFrame({'a':[5., 4., np.nan, 3., 7.], 'b':[np.nan, 3.,4.,6.,8.]})
df2

In [ ]:
df1.combine_first(df2)

# Reformatação e pivoteamento

In [ ]:
data = pd.DataFrame(np.arange(6).reshape((2,3)), index=pd.Index(['Ohio','Colorado'], name='state'), columns=pd.Index(['One','Two','three'], name='number'))
data

In [ ]:
result = data.stack()
result

In [ ]:
result.unstack()

In [ ]:
result.unstack(0)

In [ ]:
result.unstack('state')

In [ ]:
s1 = pd.Series([0,1,2,3], index=['a','b','c','d'])

In [ ]:
s2 = pd.Series([4,5,6], index=['c','d','e'])

In [ ]:
data2 = pd.concat([s1,s2], keys=['one','two'])
data2

In [ ]:
data2.unstack()

In [ ]:
data2.unstack().stack()

In [ ]:
data2.unstack().stack(dropna=False)

In [ ]:
df = pd.DataFrame({'left':result,'right':result + 5}, columns = pd.Index(['left','right'], name='side'))
df

In [ ]:
df.unstack('state')

In [ ]:
df.unstack('state').stack('side')

**Fazendo o pivoteamento de um formato "longo" para um formato "largo"** <br>
Uma maneira de armazenar séries temporais

In [ ]:
data = pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/macrodata.csv')
data.head()

In [ ]:
periods = pd.PeriodIndex(year=data.year, quarter=data.quarter, name='date')

In [ ]:
columns = pd.Index(['realgdp', 'infl','unemp'], name='item')

In [ ]:
data = data.reindex(columns=columns)

In [ ]:
data.index = periods.to_timestamp('D','end')

In [ ]:
ldata = data.stack().reset_index().rename(columns={0:'value'})

In [ ]:
ldata[:10]

In [ ]:
pivoted = ldata.pivot('date','item','value')
pivoted

In [ ]:
ldata['value2'] = np.random.randn(len(ldata))

In [ ]:
ldata[:10]

In [ ]:
pivoted = ldata.pivot('date','item')

In [ ]:
pivoted[:5]

In [ ]:
pivoted['value'][:5]

In [ ]:
unstacked = ldata.set_index(['date','item']).unstack('item')

In [ ]:
unstacked[:7]

**Pivoteamento de formato "largo" para o formato "longo"**

In [ ]:
df = pd.DataFrame({'key': ['foo','bar','baz'], 'A':[1,2,3], 'B':[4,5,6], 'C':[7,8,9]})
df

In [ ]:
melted = pd.melt(df,['key'])
melted

In [ ]:
reshaped = melted.pivot('key', 'variable','value')
reshaped

In [ ]:
reshaped.reset_index()

In [ ]:
pd.melt(df, id_vars=['key'], value_vars=['A','B'])

In [ ]:
pd.melt(df, value_vars=['A','B','C'])

In [ ]:
pd.melt(df, value_vars=['key','A','B'])